CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_pkcau.c
    /* write the modulus value n to PKCAU RAM */
    pkcau_memcpy_operand(0x00000D5CU, mont_para->modulus_n, mont_para->modulus_len);
    /* configure the operation mode */
    pkcau_mode_set(PKCAU_MODE_MONT_PARAM);
    /* start computation */
    pkcau_start();
}

/*!
    \brief      execute modular operation, include modular addition, modular subtraction and montgomery multiplication
    \param[in]  mont_para: PKCAU modular parameter struct
                  oprd_a: operand A
                  oprd_b: operand B
                  modulus_n: modulus value n
                  modulus_len: modulus length in byte
    \param[in]  mode: modular operation mode
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_MODE_MOD_ADD: modular addition
      \arg        PKCAU_MODE_MOD_SUB: modular subtraction
      \arg        PKCAU_MODE_MONT_MUL: Montgomery multiplication
    \param[out] none
    \retval     none
*/
void pkcau_mod_operation(pkcau_mod_parameter_struct *mod_para, uint32_t mode)
{
    uint32_t bit_len = mod_para->modulus_len * 8U;

    /* write the modulus length in bit to PKCAU RAM */
    pkcau_memcpy_value(0x00000404U, bit_len);
    
    /* write the operand A, operand B and modulus value n to PKCAU RAM */
    pkcau_memcpy_operand(0x000008B4U, mod_para->oprd_a, mod_para->modulus_len);
    pkcau_memcpy_operand(0x00000A44U, mod_para->oprd_b, mod_para->modulus_len);
    pkcau_memcpy_operand(0x00000D5CU, mod_para->modulus_n, mod_para->modulus_len);
    /* configure the operation mode */
    pkcau_mode_set(mode);
    /* start computation */
    pkcau_start();
}

/*!
    \brief      execute modular exponentation operation
    \param[in]  mont_para: PKCAU exponentation parameter struct for fast mode
                  oprd_a: operand A
                  exp_e: exponent e
                  e_len: exponent length in byte
                  modulus_n: modulus value n
                  modulus_len: modulus length in byte
                  mont_para: montgomery parameter R2 mod n
    \param[in]  mode: modular exponentation operation mode
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_MODE_MOD_EXP: montgomery parameter computation then modular exponentiation
      \arg        PKCAU_MODE_MOD_EXP_FAST: modular exponentiation only
    \param[out] none
    \retval     none
*/
void pkcau_mod_exp_operation(pkcau_mod_exp_parameter_struct *mod_exp_para, uint32_t mode)
{
    uint32_t e_bit_len = mod_exp_para->e_len * 8U;
    uint32_t n_bit_len = mod_exp_para->modulus_len * 8U;
    
    /* write the exponent length and modulus length in bit to PKCAU RAM */
    pkcau_memcpy_value(0x00000400U, e_bit_len);
    pkcau_memcpy_value(0x00000404U, n_bit_len);
    
    /* write the operand A, exponent e and modulus value n to PKCAU RAM */
    pkcau_memcpy_operand(0x00000A44U, mod_exp_para->oprd_a, mod_exp_para->modulus_len);
    pkcau_memcpy_operand(0x00000BD0U, mod_exp_para->exp_e, mod_exp_para->e_len);
    pkcau_memcpy_operand(0x00000D5CU, mod_exp_para->modulus_n, mod_exp_para->modulus_len);
    /* write the montgomery parameter to PKCAU RAM */
    if(mode == PKCAU_MODE_MOD_EXP_FAST){
        pkcau_memcpy_operand(0x00000594U, mod_exp_para->mont_para, mod_exp_para->modulus_len);
    }
    /* configure the operation mode */
    pkcau_mode_set(mode);
    /* start computation */
    pkcau_start();
}

/*!
    \brief      execute modular inversion operation
    \param[in]  mod_inver_para: PKCAU modular inversion parameter struct
                  oprd_a: operand A
                  modulus_n: modulus value n
                  modulus_len: modulus length in byte
    \param[out] none
    \retval     none
*/
void pkcau_mod_inver_operation(pkcau_mod_inver_parameter_struct *mod_inver_para)
{
    uint32_t bit_len = mod_inver_para->modulus_len * 8U;
    
    /* write the modulus length in bit to PKCAU RAM */
    pkcau_memcpy_value(0x00000404U, bit_len);
    
    /* write the operand A and modulus value n to PKCAU RAM */
    pkcau_memcpy_operand(0x000008B4U, mod_inver_para->oprd_a, mod_inver_para->modulus_len);
    pkcau_memcpy_operand(0x00000A44U, mod_inver_para->modulus_n, mod_inver_para->modulus_len);
    /* configure the operation mode */
    pkcau_mode_set(PKCAU_MODE_MOD_INVERSION);
    /* start computation */
    pkcau_start();
}

/*!
    \brief      execute modular reduction operation
    \param[in]  mod_reduc_para: PKCAU modular reduction parameter struct
                  oprd_a: operand A
                  oprd_a_len: length of operand A in byte
                  modulus_n: modulus value n
                  modulus_len: modulus length in byte
    \param[out] none
    \retval     none
*/
void pkcau_mod_reduc_operation(pkcau_mod_reduc_parameter_struct *mod_reduc_para)
{
    uint32_t n_bit_len = mod_reduc_para->modulus_len * 8U;
    uint32_t a_bit_len = mod_reduc_para->oprd_a_len * 8U;
    
    /* write the modulus length and length of operand A in bit to PKCAU RAM */
    pkcau_memcpy_value(0x00000400U, a_bit_len);
    pkcau_memcpy_value(0x00000404U, n_bit_len);
    
    /* write the operand A and modulus value n to PKCAU RAM */
    pkcau_memcpy_operand(0x000008B4U, mod_reduc_para->oprd_a, mod_reduc_para->oprd_a_len);
    pkcau_memcpy_operand(0x00000A44U, mod_reduc_para->modulus_n, mod_reduc_para->modulus_len);
    /* configure the operation mode */
    pkcau_mode_set(PKCAU_MODE_MOD_REDUCTION);
    /* start computation */
    pkcau_start();
}

/*!
    \brief      execute arithmetic operation
    \param[in]  arithmetic_para: PKCAU arithmetic parameter struct
                  oprd_a: operand A
                  oprd_b: operand B
                  oprd_len: length of operand in byte
    \param[in]  mode: arithmetic operation mode
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_MODE_ARITHMETIC_ADD: arithmetic addition
      \arg        PKCAU_MODE_ARITHMETIC_SUB: arithmetic subtraction
      \arg        PKCAU_MODE_ARITHMETIC_MUL: arithmetic multiplication
      \arg        PKCAU_MODE_ARITHMETIC_COMP: arithmetic comparison
    \param[out] none
    \retval     none
*/
void pkcau_arithmetic_operation(pkcau_arithmetic_parameter_struct *arithmetic_para, uint32_t mode)
{
    uint32_t bit_len = arithmetic_para->oprd_len * 8U;
    
    /* write the length of operand in bit to PKCAU RAM */
    pkcau_memcpy_value(0x00000404U, bit_len);
    
    /* write the operand A and operand B to PKCAU RAM */
    pkcau_memcpy_operand(0x000008B4U, arithmetic_para->oprd_a, arithmetic_para->oprd_len);
    pkcau_memcpy_operand(0x00000A44U, arithmetic_para->oprd_b, arithmetic_para->oprd_len);
    /* configure the operation mode */
    pkcau_mode_set(mode);
    /* start computation */
    pkcau_start();
}

/*!
    \brief      execute RSA CRT exponentation operation
    \param[in]  mod_reduc_para: PKCAU modular CRT parameter struct
                  oprd_a: operand A
                  modulus_len: modulus length in byte
                  oprd_dp: operand dp
                  oprd_dq:operand dq
                  oprd_qinv: operand qinv
                  oprd_p: prime operand p
                  oprd_q: prime operand q
    \param[out] none
    \retval     none
*/
void pkcau_crt_exp_operation(pkcau_crt_parameter_struct* crt_para)
{
    uint32_t max_len_in_bit = crt_para->oprd_len * 8U;
    
    /* write the modulus length in bit to PKCAU RAM */
    pkcau_memcpy_value(0x00000404U, max_len_in_bit); 
    
