CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_pkcau.c
    /* write the operand dp, dq, qinv, p and q to PKCAU RAM */
    pkcau_memcpy_operand(0x0000065CU, crt_para->oprd_dp, crt_para->oprd_len/2U); 
    pkcau_memcpy_operand(0x00000BD0U, crt_para->oprd_dq, crt_para->oprd_len/2U);
    pkcau_memcpy_operand(0x000007ECU, crt_para->oprd_qinv, crt_para->oprd_len/2U); 
    pkcau_memcpy_operand(0x0000097CU, crt_para->oprd_p, crt_para->oprd_len/2U);
    pkcau_memcpy_operand(0x00000D5CU, crt_para->oprd_q, crt_para->oprd_len/2U);
    /* write the operand A to PKCAU RAM */
    pkcau_memcpy_operand(0x00000EECU, crt_para->oprd_a, crt_para->oprd_len);
    /* configure the operation mode */
    pkcau_mode_set(PKCAU_MODE_CRT_EXP);
    /* start computation */
    pkcau_start();
}

/*!
    \brief      execute point check operation
    \param[in]  point_para: PKCAU point struct
                  point_x: point coordinate x
                  point_y: point coordinate y
    \param[in]  curve_group_para: PKCAU ECC curve paramter struct
                  modulus_p: curve modulus p
                  coff_a: curve coefficient a
                  coff_b: curve coefficient b
                  base_point_x: curve base point coordinate x
                  base_point_y: curve base point coordinate y
                  order_n: curve prime order n
                  a_sign: curve coefficient a sign
                  modulus_p_len: curve modulus p length in byte
                  order_n_len: curve prime order n length in byte
                  multi_k: scalar multiplier k
                  k_len: length of scalar multiplier k
    \param[out] none
    \retval     none
*/
void pkcau_point_check_operation(pkcau_point_parameter_struct* point_para, const pkcau_ec_group_parameter_struct* curve_group_para)
{
    uint32_t max_len_in_bit = curve_group_para->modulus_p_len * 8U;
    
    /* write the modulus length in bit to PKCAU RAM */
    pkcau_memcpy_value(0x00000404U, max_len_in_bit);
    /* write the sign of curve coefficient a to PKCAU RAM */
    pkcau_memcpy_value(0x00000408U, curve_group_para->a_sign);
    
    /* write the curve coefficient a, curve coefficient b and curve modulus p to PKCAU RAM */
    pkcau_memcpy_operand(0x0000040CU, curve_group_para->coff_a, curve_group_para->modulus_p_len);
    pkcau_memcpy_operand(0x000007FCU, curve_group_para->coff_b, curve_group_para->modulus_p_len);
    pkcau_memcpy_operand(0x00000460U, curve_group_para->modulus_p, curve_group_para->modulus_p_len);
    /* write the point coordinate x and point coordinate y to PKCAU RAM */
    pkcau_memcpy_operand(0x0000055CU, point_para->point_x, curve_group_para->modulus_p_len);
    pkcau_memcpy_operand(0x000005B0U, point_para->point_y, curve_group_para->modulus_p_len);
    /* configure the operation mode */
    pkcau_mode_set(PKCAU_MODE_POINT_CHECK);
    /* start computation */
    pkcau_start();
}

/*!
    \brief      execute point multiplication operation
    \param[in]  point_para: PKCAU point struct
                  point_x: point coordinate x
                  point_y: point coordinate y
    \param[in]  curve_group_para: PKCAU ECC curve paramter struct
                  modulus_p: curve modulus p
                  coff_a: curve coefficient a
                  coff_b: curve coefficient b
                  base_point_x: curve base point coordinate x
                  base_point_y: curve base point coordinate y
                  order_n: curve prime order n
                  a_sign: curve coefficient a sign
                  modulus_p_len: curve modulus p length in byte
                  order_n_len: curve prime order n length in byte
                  multi_k: scalar multiplier k
                  k_len: length of scalar multiplier k
                  mont_para: montgomery parameter R2 mod n
    \param[in]  mode: point multiplication operation mode
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_MODE_ECC_MUL: montgomery parameter computation then ECC scalar multiplication
      \arg        PKCAU_MODE_ECC_MUL_FAST: ECC scalar multiplication only
    \param[out] none
    \retval     none
*/
void pkcau_point_mul_operation(pkcau_point_parameter_struct *point_para, const pkcau_ec_group_parameter_struct* curve_group_para, uint32_t mode)
{
    uint32_t k_len = curve_group_para->k_len * 8U;
    uint32_t max_len_in_bit = curve_group_para->modulus_p_len * 8U;
    
    /* write the length of scalar multiplier k, curve modulus p length in bit and curve coefficient a sign to PKCAU RAM */
    pkcau_memcpy_value(0x00000400U, k_len);
    pkcau_memcpy_value(0x00000404U, max_len_in_bit);
    pkcau_memcpy_value(0x00000408U, curve_group_para->a_sign);
    
    /* write the curve coefficient a, curve modulus p, scalar multiplier k, point coordinate x and point coordinate y to PKCAU RAM */
    pkcau_memcpy_operand(0x0000040CU, curve_group_para->coff_a, curve_group_para->modulus_p_len);
    pkcau_memcpy_operand(0x00000460U, curve_group_para->modulus_p, curve_group_para->modulus_p_len);
    pkcau_memcpy_operand(0x00000508U, curve_group_para->multi_k, curve_group_para->k_len);
    pkcau_memcpy_operand(0x0000055CU, point_para->point_x, curve_group_para->modulus_p_len);
    pkcau_memcpy_operand(0x000005B0U, point_para->point_y, curve_group_para->modulus_p_len);
    if(mode == PKCAU_MODE_ECC_MUL_FAST){
        pkcau_memcpy_operand(0x000004B4U, curve_group_para->mont_para, curve_group_para->modulus_p_len);
    }
    /* configure the operation mode */
    pkcau_mode_set(mode);
    /* start computation */
    pkcau_start();
}

/*!
    \brief      execute ECDSA sign operation
    \param[in]  p_key_d: private key d
    \param[in]  k: integer k
    \param[in]  hash_para: hash struct
                  hash_z: hash value z
                  hash_z_len: hash value z length in byte
    \param[in]  curve_group_para: PKCAU ECC curve paramter struct
                  modulus_p: curve modulus p
                  coff_a: curve coefficient a
                  coff_b: curve coefficient b
                  base_point_x: curve base point coordinate x
                  base_point_y: curve base point coordinate y
                  order_n: curve prime order n
                  a_sign: curve coefficient a sign
                  modulus_p_len: curve modulus p length in byte
                  order_n_len: curve prime order n length in byte
                  multi_k: scalar multiplier k
                  k_len: length of scalar multiplier k
                  mont_para: montgomery parameter R2 mod n
    \param[out] none
    \retval     none
*/
void pkcau_ecdsa_sign_operation(const uint8_t* p_key_d, const uint8_t* k, pkcau_hash_parameter_struct *hash_para, const pkcau_ec_group_parameter_struct* curve_group_para)
{
    uint32_t max_len_in_bit = curve_group_para->modulus_p_len * 8U;
    
    /* write the curve prime order n length, curve modulus p length in bit and curve coefficient a sign to PKCAU RAM */
    pkcau_memcpy_value(0x00000400U, curve_group_para->order_n_len * 8U);
    pkcau_memcpy_value(0x00000404U, max_len_in_bit);
    pkcau_memcpy_value(0x00000408U, curve_group_para->a_sign);
    
