CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_pkcau.c
    /* write the curve coefficient a to PKCAU RAM */
    pkcau_memcpy_operand(0x0000040CU, curve_group_para->coff_a, curve_group_para->modulus_p_len);
    /* write the curve modulus p to PKCAU RAM */
    pkcau_memcpy_operand(0x00000460U, curve_group_para->modulus_p, curve_group_para->modulus_p_len);
    /* write the integer k to PKCAU RAM */
    pkcau_memcpy_operand(0x00000508U, k, curve_group_para->modulus_p_len);
    /* write the curve base point coordinate x to PKCAU RAM */
    pkcau_memcpy_operand(0x0000055CU, curve_group_para->base_point_x, curve_group_para->modulus_p_len);
    /* write the curve base point coordinate y to PKCAU RAM */
    pkcau_memcpy_operand(0x000005B0U, curve_group_para->base_point_y, curve_group_para->modulus_p_len);
    /* write the hash value z and hash value z length in byte to PKCAU RAM */
    pkcau_memcpy_operand(0x00000DE8U, hash_para->hash_z, hash_para->hash_z_len);
    /* write the private key d to PKCAU RAM */
    pkcau_memcpy_operand(0x00000E3CU, p_key_d, curve_group_para->modulus_p_len);
    /* write the curve prime order n to PKCAU RAM */
    pkcau_memcpy_operand(0x00000E94U, curve_group_para->order_n, curve_group_para->order_n_len);
    /* configure the operation mode */
    pkcau_mode_set(PKCAU_MODE_ECDSA_SIGN);
    /* start computation */
    pkcau_start();
}

/*!
    \brief      execute ECDSA verification operation
    \param[in]  point_para: PKCAU point struct
                  point_x: point coordinate x
                  point_y: point coordinate y
    \param[in]  hash_para: hash struct
                  hash_z: hash value z
                  hash_z_len: hash value z length in byte
    \param[in]  signature_para: signature struct
                  sign_r: signature part r
                  sign_s: signature part s
    \param[in]  curve_group_para: PKCAU ECC curve paramter struct
                  modulus_p: curve modulus p
                  coff_a: curve coefficient a
                  coff_b: curve coefficient b
                  base_point_x: curve base point coordinate x
                  base_point_y: curve base point coordinate y
                  order_n: curve prime order n
                  a_sign: curve coefficient a sign
                  modulus_p_len: curve modulus p length in byte
                  order_n_len: curve prime order n length in byte
                  multi_k: scalar multiplier k
                  k_len: length of scalar multiplier k
                  mont_para: montgomery parameter R2 mod n
    \param[out] none
    \retval     none
*/
void pkcau_ecdsa_verification_operation(pkcau_point_parameter_struct *point_para, \
                              pkcau_hash_parameter_struct *hash_para, \
                              pkcau_signature_parameter_struct *signature_para, \
                              const pkcau_ec_group_parameter_struct* curve_group_para)
{
    uint32_t max_len_in_bit = curve_group_para->modulus_p_len * 8U;

    /* write the curve prime order n length, curve modulus p length in bit and curve coefficient a sign to PKCAU RAM */
    pkcau_memcpy_value(0x00000404U, curve_group_para->order_n_len * 8U);
    pkcau_memcpy_value(0x000004B4U, max_len_in_bit);
    pkcau_memcpy_value(0x0000045CU, curve_group_para->a_sign);
    
    /* write the curve coefficient a to PKCAU RAM */
    pkcau_memcpy_operand(0x00000460U, curve_group_para->coff_a, curve_group_para->modulus_p_len);
    /* write the curve modulus p to PKCAU RAM */
    pkcau_memcpy_operand(0x000004B8U, curve_group_para->modulus_p, curve_group_para->modulus_p_len);
    /* write the curve base point coordinate x to PKCAU RAM */
    pkcau_memcpy_operand(0x000005E8U, curve_group_para->base_point_x, curve_group_para->modulus_p_len);
    /* write the curve base point coordinate y to PKCAU RAM */
    pkcau_memcpy_operand(0x0000063CU, curve_group_para->base_point_y, curve_group_para->modulus_p_len);
    /* write the point coordinate x to PKCAU RAM */
    pkcau_memcpy_operand(0x00000F40U, point_para->point_x, curve_group_para->modulus_p_len);
    /* write the point coordinate y to PKCAU RAM */
    pkcau_memcpy_operand(0x00000F94U, point_para->point_y, curve_group_para->modulus_p_len);
    /* write the signature part r to PKCAU RAM */
    pkcau_memcpy_operand(0x000001098U, signature_para->sign_r, curve_group_para->modulus_p_len);
    /* write the signature part s to PKCAU RAM */
    pkcau_memcpy_operand(0x00000A44U, signature_para->sign_s, curve_group_para->modulus_p_len);
    /* write the hash value z and hash value z length in byte to PKCAU RAM */
    pkcau_memcpy_operand(0x00000FE8U, hash_para->hash_z, hash_para->hash_z_len);
    /* write the curve prime order n to PKCAU RAM */
    pkcau_memcpy_operand(0x00000D5CU, curve_group_para->order_n, curve_group_para->order_n_len);
    /* configure the operation mode */
    pkcau_mode_set(PKCAU_MODE_ECDSA_VERIFICATION);
    /* start computation */
    pkcau_start();
}

/*!
    \brief      read result from PKCAU RAM
    \param[in]  offset: RAM address offset to PKCAU base address
    \param[out] buf: big endian result buffer, the left most byte from the PKCAU should be in the first element of buffer
    \param[in]  size: number of byte to read
    \retval     none
*/
void pkcau_memread(uint32_t offset, uint8_t buf[], uint32_t size)
{
    uint32_t  data = 0U, i = 0U, j = 0U;
    
    /* read data from PKCAU RAM */
    while(size >= 4U){
        data = *(uint32_t*)((uint32_t)(PKCAU_BASE + offset + i));
        i = i + 4U;
        
        /* data in PKCAU RAM is big endian */
        buf[size-1U] = (uint8_t)(data & 0xffU);
        buf[size-2U] = (uint8_t)((data >> 8U) & 0xffU);
        buf[size-3U] = (uint8_t)((data >> 16U) & 0xffU);
        buf[size-4U] = (uint8_t)((data >> 24U) & 0xffU);
        size -= 4U;
    }
    /* read data from PKCAU RAM which is not a multiple of four */
    if(size > 0U){
        data = *(uint32_t*)((uint32_t)(PKCAU_BASE + offset + i));
        for(j = 0U; j < size; j++){
            buf[j] = (uint8_t)((data >> ((size-1U-j) * 8U)) & 0xffU);
        }
    }
}

/*!
    \brief      get PKCAU flag status
    \param[in]  flag: PKCAU flags
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_FLAG_ADDRERR: address error flag
      \arg        PKCAU_FLAG_RAMERR: PKCAU RAM error flag
      \arg        PKCAU_FLAG_END: end of PKCAU operation flag
      \arg        PKCAU_FLAG_BUSY: busy flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus pkcau_flag_get(uint32_t flag)
{
    if(RESET != (PKCAU_STAT & flag)){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear PKCAU flag status
    \param[in]  flag: PKCAU flags
                one or more parameters can be selected which is shown as below:
      \arg        PKCAU_FLAG_ADDRERR: address error flag
      \arg        PKCAU_FLAG_RAMERR: PKCAU RAM error flag
      \arg        PKCAU_FLAG_END: end of PKCAU operation flag
    \param[out] none
    \retval     none
*/
void pkcau_flag_clear(uint32_t flag)
{
    switch(flag){
    /* clear address error flag */
    case PKCAU_FLAG_ADDRERR:
        PKCAU_STATC |= PKCAU_STATC_ADDRERRC;
        break;
    /* clear PKCAU RAM error flag */
    case PKCAU_FLAG_RAMERR:
        PKCAU_STATC |= PKCAU_STATC_RAMERRC;
        break;
    /* clear end of PKCAU operation flag */
    case PKCAU_FLAG_END:
        PKCAU_STATC |= PKCAU_STATC_ENDC;
        break;
    default :
        break;
    }
}

/*!
    \brief      enable PKCAU interrupt
    \param[in]  interrupt: interrupt type
                one or more parameters can be selected which is shown as below:
      \arg        PKCAU_INT_ADDRERR: address error interrupt
      \arg        PKCAU_INT_RAMERR: PKCAU RAM error interrupt
      \arg        PKCAU_INT_END: end of PKCAU operation interrupt
    \param[out] none
    \retval     none
*/
void pkcau_interrupt_enable(uint32_t interrupt)
{
    PKCAU_CTL |= interrupt;
}

/*!
    \brief      disable PKCAU interrupt
    \param[in]  interrupt: interrupt type
                one or more parameters can be selected which is shown as below:
      \arg        PKCAU_INT_ADDRERR: address error interrupt
      \arg        PKCAU_INT_RAMERR: PKCAU RAM error interrupt
      \arg        PKCAU_INT_END: end of PKCAU operation interrupt
    \param[out] none
    \retval     none
*/
void pkcau_interrupt_disable(uint32_t interrupt)
{
    PKCAU_CTL &= ~(interrupt);
}

/*!
    \brief      get PKCAU interrupt flag status
    \param[in]  int_flag: PKCAU interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_INT_FLAG_ADDRERR: address error interrupt flag
      \arg        PKCAU_INT_FLAG_RAMERR: PKCAU RAM error interrupt flag
      \arg        PKCAU_INT_FLAG_END: end of PKCAU operation interrupt flag
    \param[out] none
    \retval     FlagStatus: SET or RESET
*/
FlagStatus pkcau_interrupt_flag_get(uint32_t int_flag)
{
    uint32_t reg1 = PKCAU_CTL;
    uint32_t reg2 = PKCAU_STAT;

    switch(int_flag){
    /* clear address error interrupt flag */
    case PKCAU_INT_FLAG_ADDRERR:
        reg1 = reg1 & PKCAU_CTL_ADDRERRIE;
        reg2 = reg2 & PKCAU_STAT_ADDRERR;
        break;
    /* clear RAM error interrupt flag */
    case PKCAU_INT_FLAG_RAMERR:
        reg1 = reg1 & PKCAU_CTL_RAMERRIE;
        reg2 = reg2 & PKCAU_STAT_RAMERR;
        break;
    /* clear end of PKCAU operation interrupt flag */
    case PKCAU_INT_FLAG_END:
        reg1 = reg1 & PKCAU_CTL_ENDIE;
        reg2 = reg2 & PKCAU_STAT_ENDF;
        break;
    default :
        break;
    }
    /*get PKCAU interrupt flag status */
    if(reg1 && reg2){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      clear PKCAU interrupt flag status
    \param[in]  int_flag: PKCAU interrupt flags
                only one parameter can be selected which is shown as below:
      \arg        PKCAU_INT_FLAG_ADDRERR: address error interrupt flag
      \arg        PKCAU_INT_FLAG_RAMERR: PKCAU RAM error interrupt flag
      \arg        PKCAU_INT_FLAG_END: end of PKCAU operation interrupt flag
    \param[out] none
    \retval     none
*/
void pkcau_interrupt_flag_clear(uint32_t int_flag)
{
    switch(int_flag){
    /* clear address error interrupt flag */
    case PKCAU_INT_FLAG_ADDRERR:
        PKCAU_STATC |= PKCAU_STATC_ADDRERRC;
        break;
    /* clear PKCAU RAM error interrupt flag */
    case PKCAU_INT_FLAG_RAMERR:
        PKCAU_STATC |= PKCAU_STATC_RAMERRC;
        break;
    /* clear end of PKCAU operation interrupt flag */
    case PKCAU_INT_FLAG_END:
        PKCAU_STATC |= PKCAU_STATC_ENDC;
        break;
    default:
        break;
    }
}

/*!
    \brief      copy normal 32-bit value to PKCAU RAM
    \param[in]  offset: RAM address offset to PKCAU base address
    \param[in]  value: the value needed to write into PKCAU RAM
    \param[out] none
    \retval     none
*/
static void pkcau_memcpy_value(uint32_t offset, uint32_t value)
{
    uint32_t* addr = (uint32_t*)((uint32_t)(PKCAU_BASE + offset));
    *addr = value;
}

/*!
    \brief      copy operand with EOS or ROS to PKCAU RAM
    \param[in]  offset: RAM address offset to PKCAU base address
    \param[in]  operand: the big endian operand vector, the left most byte of the value should be in the first element of the vector
    \param[in]  size: operand vector length in byte
    \retval     none
*/
static void pkcau_memcpy_operand(uint32_t offset, const uint8_t operand[], uint32_t size)
{
    uint32_t data = 0U, i = 0U, j = 0U;

    while(size >= 4U){
        /* convert the big endian operand vector to little endian parameter to input to PKCAU RAM */
        data = (uint32_t)((uint32_t)operand[size-1U] | ((uint32_t)operand[size-2U] << 8U) | ((uint32_t)operand[size-3U] << 16U) | ((uint32_t)operand[size-4U] << 24U));
        *(uint32_t*)((uint32_t)(PKCAU_BASE + offset + i)) = data;
        i = i + 4U;
        size -= 4U;
    }
    /* convert the big endian operand vector to little endian parameter to input to PKCAU RAM which is not a multiple of four */
    if(size > 0U){
        data = 0U;
        for(j = 0U; j < size; j++){
            data = (uint32_t)((data << 8U) | (uint32_t)operand[j]);
        }
        *(uint32_t*)((uint32_t)(PKCAU_BASE + offset + i)) = data;
        i = i + 4U;
    }
    
    /* an additional word 0x00000000 is expected by the PKCAU */
    *(uint32_t*)((uint32_t)(PKCAU_BASE + offset + i)) = 0x00000000U;
}
